{"pages":[{"title":"what","text":"what what's here","link":"/what/index.html"}],"posts":[{"title":"My First Page","text":"航概作业 第一章 1.1基础部分：单选 123451-5DABCB 6-10DABCB 11-15BDCAA 16-20DBBCB21-25BABBA 26-30CBABD 31-35AABAB 36-40CCDBC41-45ACDCD 46-50CDBDB 56-60BCAAB 51-55CBCAB61-65CCDDC 66-70DBBBC 71-75ABBDD 76-80DDDBC81-85 CBCDD 86-90 BDBBD 91-92BB 1.2基础部分：多选 123456781-5 BC ACD ABD ABD BC6-10 BCD AC BC AB ABC 11-15 CD ABD ABD BD ABC16-20 BC ACDACBCAC21-25 ACD ABCD ABD AD ACD 26-30 ABC ABD ABD AC BC31-35 AC BCD ABD BCD ABD36-37 BD ABCD 1.3深化部分：单选 1231-5DBBCB 6-10CBBDB 11-15BDDDA 16-20BCABA21-25ACBBB 26-30DAABB 31-35DAABB 36-40ADABC41-45AAABC 46-50 DCBCA51C 1.4深化部分：多选 12341-5 ABD BCD AD AC BD6-10 BD BCD ABD ACD ABD11-15 ABCD BD ABD BCD ABD 16-18 AC ABCD ACD 1.5拓展部分：单选 121-5CDBDD 6-10AACCC 11-15ADDBC 16-20DCCDD21-25 CBBCD 26-30 DCBCA 31-35 DCDBC 36-39 ACDC 1.6拓展部分：多选 12341-5 AD BD AC ABC ABCD6-10 ABD ABD ABD ABCD ABD11-15 BD BCD BD ABC ABD16 AD 1.7图片填空 螺旋桨、副翼、机翼、水平安定面、垂直安定面、方向舵、升降舵、襟翼、主起落架、动力装置、前起落架、机身 低速、亚声速、跨声速、超声速、高超声速 第二章 2.1基础部分：单选 1234593-95DBC 96-100DBBCC 101-105AACDC 106-110BDCCD111-115BCBBC 116-120DBDBD 121-125DACCB 126-130BAABD131-135BDBBA 136-140CADBB 141-145BCBCD 146-150CDADB151-155CACBB 156-160ACBCA 161-165BACCC 166-170ABCAB171-175CCDCA 176C 2.2基础部分：多选 1234567891038-40 ABC AB ABCD41-45 ABC ABCD ABD AB CD46-50 BCD CD ABC ACD AB51-55 ABC ABD ACD ABD ACD56-60 ABD ABC ACD ACD ACD61-65 BC ABD CD ABC ABC66-70 AB AD ACD AB ABCD71-75 AB CD ABC ABC BCD76-80 ABCD BCD BCD ABD ABC 81-85 ABCD ACD ABC BCD ABD 2.3深化部分：单选 12352-55CBBD 56-60DCBAB 61-65AABCD 66-70AACBD71-75CABCB 76-80CAAAC 81-85BDABB 86-90ABCBD91-94CACD 2.4深化部分：多选 12319-20 BC BC21-25 ABD ABC ABCD ABC ACD26-29 ABD BC ACD ACD 2.5拓展部分：单选 1240C 41-45 BBDDA 46-50DDBAD 51-55CCBDD56-60CCADA 61-64ABBD 2.6拓展部分：多选 12317-20 ABC BCD CD AC21-25 ABD ABD ABC AB ABC26-28 ACD AB ABD 2.7图片填空 空气动力作用点、翼型前缘、翼型后缘、翼型弦线、升力、空气动力合力、阻力、迎角 层流层、紊流层、转振点、分离点 地面滑跑、离地、爬升 下滑、拉平、平飞减速、飘落触地、着陆滑跑 停泊轨道、地月转移轨道、环月轨道 入轨点、发射轨道、运行轨道 第三章 3.1基础部分：单选 1234177-180ACBC 181-185DACAB 186-190BDABB 191-195ABACB196-200BDAAC 201-205BBDCD 206-210BBDCC 211-215BBABC216-220ADCAB 221-225CCBBB 226-230ABDBD 231-235BABDC236B 3.2基础部分：多选 1234567886-90 ABCD ABD BCD AD AB91-95 ABD BCD BCD AD ACD96-100 BD AB AD AC ABC101-105 AC BC ABC ABC AD106-110 BCD BCD BCD AC ABD 111-115 ABCD ABC ACD BC CD116-120 AB ACD ABCD ABC BC 121-123 ABD ACD ACD 3.3深化部分：单选 1295B 96-100BBDCB 101-105CBBCA 106-110BDBDC111-115CCAAC 116-120BCDBD 121-125 ACBCC 126-129BBCA 3.4深化部分：多选. 12345630 ABCD31-35 ACD BCD BD ABCD ABCD36-40 AD CD CD ABD ACD41-45 AB ABD AB ACD ABC46-50 CD ABDBCACABC51-52 ACD BC 3.5拓展部分：单选 165B 66-70CCABC 71-75AACDB 76A 3.6拓展部分：多选 129-30 ACD BCD 3.7图片填空 进气、压缩、膨胀、排气 进气道、压气机燃烧室、涡、·尾喷管 导流器、导气管、离心叶轮、扩散器 喷嘴、内焰简、燃烧室外套、涡流器 单管燃烧室、联管燃烧室、环形燃烧室 螺旋桨、减速齿轮、进气道、压气机、燃烧室、涡轮、尾喷管 进气道、压气机、燃烧室、涡轮、奖扇 第四章 4.1基础部分：单选 12345237-240AAAA 241-245DBDAA 246-250BDCDB 251-255BDCBC 256-260CDABB 261-265DACAB 266-270BCBAB 271-275CACBC 276-280CABBC 281-285DACDB 286-290BDCBC 291-295CDADD296-300ADBBA 301-305CDADC 306-310BCDCA 311-315DDDDD 316-320BBDCA 321-324CABD 4.2基础部分：多选 12345678910124-125 ABC ABCD126-130 AB ACD AC ABD BCD131-135 ACD ABD ABC BC BCD 136-140 ACD ABC BD ABC ABD141-145 ABD AB AD ABCD ABD146-150 BCD AC ACD ABCD AC151-155 ABC ABCD ACD BD AB 156-160 BCD ABCD ABD ACD ABCD161-165 ACD AD ABC AB ABC 166-168 ABCD BCACD 4.3深化部分：单选 123130C 131-135ACBCA 136-140CDADA 141-145BBADD146-150BACCB 151-155CDCBA 156-160BDDBA 161-165DCACA166-167DC 4.4深化部分：多选 12353-55 AB ACD AD56-60 ABD BD ABC ACD AC61-65 BC AD BCD ABD AD 4.5拓展部分：单选 1277-80 BBBC 81-85DCBDB 86-90DBDDB 91-95 CBDAB96-100CDCAB 101-105CCBAB 106-110CCABC 111-112DB 4.6拓展部分：多选. 123431-35 BCD BCDAC ABC BC36-40 BD AB AC ABD BC41-45 BCD BD ABC ABD ABCD46 BCD 4.7图片填空 标准气压、绝对、真实、相对 零、总压、总压管、静压、静压、静压管 第五章 5.1基础部分：单选 123325D 326-330CBCCA 331-335BBACC 336-340DBDCB341-345CACBB 346-350CBDCC 351-355BADDD 356-360AABCC361-365DCCDC 366-370CBCDC 371-375BABBC 376-378ACD 5.2基础部分：多选 12345678910111213169-170 AB ABCD171-175 ABD AB CD ABCD ABD176-180 AC ABC CD BD BD181-185 BCD ACD ABC ACD BC186-190 BC ABC BC ABC BD191-195 BCD BCD AD AC AB196-200 AC BCD ABD AD ABC201-205 BD BCD ABCD ACD AB206-210 ACD AB ABD BCD ACD211-215 AD ABCD BC AC ABC216-220 BC AD ACD AB AD221-225 ABC BCD ABC CD ABCD226 BCD 5.3深化部分：单选 12168-170CDB 171-175ABADD 176-180ABBCA 181-185CCABB186-190BDCAB 191-195CBACD 196-200BBDBA 201-205BABCC 5.4深化部分：多选 12366-70 BCD ABD AB BD AD71-75 BD BC AD ABCD AB76-80 ABC ABCDABCD BC AD 5.5拓展部分：单选 12113-115BCC 116-120DCBCA 121-125BDDBA 126-130DCDDB131-135CDCBA 5.6拓展部分：多选 1234547-50 CD AC ACD AD51-55 AC ABCAC AD AC56-60 AC BC CD BC BD61-65 ABCD ACD BC BC AC66 CD 5.7图片填空 放气顶盖、顶盖操纵绳、气囊，加热器、吊篮、吊索 头部锥形支撑件、吊挂索系、气囊、方向能、升降能、发动机、吊舱、副气囊 沿翼展方向分布气动力、沿翼展方向分布质量力、集中质量力、发动机推力 扭矩、弯矩、剪力 蒙皮、翼梁、前纵墙、翼梁接头、加强翼肋、普通翼肋 缘条、加强立柱、腹板 收放作动筒、收起位置、撑杆、支柱、机轮 质量块、重力杆、卫星","link":"/2023/05/31/My-First-Page/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick Start Create a new post 1$ hexo new &quot;My New Post&quot; More info: Writing Run server 1$ hexo server More info: Server Generate static files 1$ hexo generate More info: Generating Deploy to remote sites 1$ hexo deploy More info: Deployment","link":"/2023/05/31/hello-world/"},{"title":"计网","text":"计算机网络期末复习 Update：2023/05/31 复习第一章课件部分 第一章、计算机网络概述 1.1 互联网概述 计算机网络的四个发展阶段： 面向终端的计算机网络： 第一阶段的缺点： 主机通信开销大，通信线路利用率低，对主机系统依赖性较大。规模小，终端数量少。 多台计算机互连的计算机网络：提出分组交换技术、形成TCP/IP协议雏形 分组交换网络的基本要求： 网络侧重于计算机之间的数据传送 网络能够连接不同类型的计算机 计算机在进行通信时，必须有冗余的路由 网络的结构应当尽可能地简单，同时还能够非常可靠地传送数据 分组交换网和面向终端的计算机的网络的区别： 分组交换网是以网络为中心，主机处在网络的外围 面向终端的网络是以单个主机位中心的星形网 第二阶段的缺点： 没有形成统一的互连标准，使网络在规模与应用等方面受到了限制、 面向标准化的计算机网络：形成网络体系结构、TCP/IP结构、形成各种标准 ISO/OSI-RM国际标准，该模型按层次结构将网络划分为七个子层 形成了以TCP/IP为核心的因特网。任何一台计算机只要遵循TCP/IP协议族标准，并有一个合法的IP地址，就可以接入到Internet。 面向全球互连的计算机网络： 1.2 互联网的组成 计算机网络：是互连的、自治的计算机集合。自治：指网络中无主从关系。 主机（hosts）是端系统，运行各种网络应用程序。 网络协议（network protocol），是为进行网络中的数据交换而建立的规则、标准或约定；协议规定了通信实体之间所交换的消息的格式、意义、顺序以及针对收到信息或发生的事件所采取的“动作”。协议规范了网络中所有信息发送和接收过程。 协议的三要素：语法、语义、同步 计算机网络结构： 网络边缘：主机、客户/服务器模型（client/server）、对等应用模型（P2P） 接入网络：有线或无线通信链路 网络核心：网络的核心功能：路由和转发 路由：确定分组从源到目的传输路径 转发：将分组从路由器的输入端口交换至正确的输出端口 如何实现数据从源主机通过网络核心送达目的主机？数据交换 数据交换技术： 电路交换： 在通信之前，需要在主、被叫用户之间建立一条物理连接 采用了静态的时分复用，独占资源 没有任何差错控制措施 报文交换： 采用存储－转发方式对每份报文完整地加以处理 每份报文中含有报头，包含收、发双方的地址，以便交换节点进行路由选择 存储-转发的时延大，随机性也大 分组交换： 在发送端，先把较长的报文划分成较短的、固定长度的数据段。每一个数据段前面添加上首部构成分组 分组交换网以分组作为数据传输单元。依次把各分组发送到接收端 每一个分组的首部都含有地址，交换机根据收到的分组首部中的地址信息，把分组转发到下一个结点交换机。 每个分组在互联网中独立地选择传输路径。 接收端收到分组后剥去首部还原成部分报文，最后所有报文连接起来恢复成原来的报文。 分组交换的优点： 在分组传输的过程中动态分配传输带宽，对通信链路是逐段占用 每一个分组独立地选择最合适的转发路由 以分组作为传送单位，可以不先建立连接就能向其他主机发送分组 保证可靠性的网络协议 分组交换的问题： 分组在各结点存储转发时需要排队，这就会造成一定的时延。 分组必须携带的首部，会造成额外的开销。 互联网的核心部分是由许多网络和把它们互连起来的路由器组成，而主机处在互联网的边缘部分。核心部分中的路由器之间一般都用高速链路相连接，而在网络边缘的主机接入到核心部分则通常以相对较低速率的链路相连接。主机的用途是为用户进行信息处理的，并且可以和其他主机通过网络交换信息。路由器的用途则是用来转发分组的，即进行分组交换的。 1.3 计算机网络的类别 计算机网络的定义： 计算机网络主要是由一些通用的、可编程的硬件互连而成的，而这些硬件并非专门用来实现某一特定目的（例如，传送数据或视频信号）。这些可编程的硬件能够用来传送多种不同类型的数据，并能支持广泛的和日益增长的应用。 注：上述的“可编程的硬件”表明这种硬件一定包含有中央处理机 (CPU)。 用来把用户接入到互联网的网络，为接入网AN，接入网是从某个用户端系统到互联网中的第一个路由器（也称为边缘路由器）之间的一种网络。接入网本身既不属于互联网的核心部分，也不属于互联网的边缘部分。 1.4 计算机网络的性能 1.4.1 性能指标 速率 单位时间（秒）传输信息（比特）量 单位：、、 带宽 数字信道所能传送的“最高数据率” 延迟/时延 延迟：正在等待排队的分组、正在传输的分组 丢包：路由器缓存满、到达分组被丢弃 结点处理延迟 ：用于差错检测、确定输出链路 排队延迟 传输/发送延迟 分组长度传输速率，是分组发送出端口的时间 传播延迟 物理链路长度信号传输速度，是分组在物理线路上传播的时间 延迟时间是上面四者的和 流量强度：，R链路传输速率，L分组长度，a平均分组到达速率。流量强度接近0表示平均排队延迟很小，接近1表示延迟很大，大于1表示超出服务能力、平均延迟无限大。 时延带宽积 = 传播时延 × 带宽。表示以比特为单位的链路长度 丢包率 = 丢包数 ÷ 已发分组数 吞吐量 在发送端与接收端之间数据传输速率 瓶颈链路：端到端路径上，限制端到端吞吐量的链路。即吞吐量的最小值 往返时间RTT 往返时间表示从发送方发送数据开始，到发送方收到来自接收方的确认，总共经历的时间。 利用率 分为信道利用率和网络利用率。 网络利用率则是全网络的信道利用率的加权平均值。 信道利用率增大时，该信道的时延迅速增大。 1.4.2 非性能指标 包括质量、费用、可靠性等等 1.5 计算机网络的体系结构 是分层结构 计算机网络体系结构是计算机网络的功能层次、其关系及其协议的集合，是抽象的。 协议： 协议是控制两个对等实体进行通信的规则的集合。 协议控制两个对等实体之间的通信使得本层能够向上一层提供服务。 协议是水平的。 要实现某层的协议，还需要使用下面一层所提供的服务。 服务： 任意一层实体需要使用下层服务，遵循本层协议，实现本层功能，向上层提供服务。 服务是垂直的。 下层协议的实现对上层的服务用户是透明的。 接口：又称服务访问点，从物理层开始，每一层都向上层提供服务访问点，即没有接口就不能提供服务。 相邻层之间是通过接口进行交互的，通过服务访问点SAP，交换服务原语，请求特定服务。 数据封装：增加控制信息 地址: 标识发送端/接收端 差错检测编码 协议控制 OSI7层模型各层次的功能： 物理层 接口特性 比特编码 数据率、比特同步 传输模式：单工、半双工、全双工 数据链路层 负责结点-结点数据传输 组帧（开头结尾加DT和DH） 物理寻址：发送和接收端物理地址的标志 流量控制、差错控制、访问控制 网络层 负责源主机到目的主机数据分组交付 逻辑寻址：全局唯一逻辑地址，确保数据送达目的主机，例如IP地址 路由和转发功能 传输层 负责源主机到目的主机进程间完整的报文传输 分段和重组功能 SAP服务访问点寻址：提交给正确的进程 流量控制、差错控制、连接控制 会话层 对话控制 同步 最薄的一层 表示层 数据表示转化、数据编码 加密、解密 压缩、解压缩 应用层 用户通过网络接口使用网络 文件传输FTP、web HTTP、邮件SMTP等等 路由器在转发分组的时候最高只用到网络层，不使用传输层和应用层。 TCP/IP四层体系：应用层、运输层、网际层和网络接口层。 因此往往采取折中的办法，即综合OSI和TCP/IP的优点，采用一种只有五层协议的体系结构。 应用层: 支持各种网络应用：FTP, SMTP, HTTP 传输层: 进程-进程的数据传输：TCP, UDP 网络层: 源主机到目的主机的数据分组路由与转发：IP协议、路由协议等 链路层: 相邻网络元素（主机、交换机、路由器等）的数据传输：以太网（Ethernet）、802.11 (WiFi)、 PPP 物理层: 比特传输 信息在源主机从应用层逐层封装一直到物理层 在交换机经过物理层和链路层处理 在路由器经过物理层、链路层和网络层处理 最后到达目的主机从物理层逐层向上到达应用层","link":"/2023/05/31/%E8%AE%A1%E7%BD%91/"}],"tags":[{"name":"1.0v","slug":"1-0v","link":"/tags/1-0v/"},{"name":"internet","slug":"internet","link":"/tags/internet/"},{"name":"计网","slug":"计网","link":"/tags/%E8%AE%A1%E7%BD%91/"}],"categories":[]}